---
kind: type
id: T:Autodesk.Revit.DB.NumberingSchemaTypes
source: html/f35deaf0-5c35-a492-5d8e-6e1b00f08ff9.htm
---
# Autodesk.Revit.DB.NumberingSchemaTypes

Provides a container of all Revit built-in NumberingSchemaType instances.

## Syntax (C#)
```csharp
public static class NumberingSchemaTypes
```